app/Models/Configs.php

    public function dataConfig()
    {
        return $this->orderBy('created_at', 'DESC')->first();
---
SELECT *
FROM `configs`
ORDER BY `created_at` DESC
 LIMIT 1